rottenpotatoes/app/controllers/movies_controller.rb

  def search
    @similar_movies = Movie.similar_movies(params[:title])
    if @similar_movies.nil?
      flash[:notice] = "Movie '#{params[:title]}' has no director info"
      redirect_to movies_path, alert: "'#{params[:title]}' has no director info"
    end
    @movie = Movie.find_by(title: params[:title])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "Star Wars"]]